HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxFlash_bf.h
/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S6WOP */
#define IFX_FLASH_PROCONWOP_S6WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S6WOP */
#define IFX_FLASH_PROCONWOP_S6WOP_OFF (6)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_OFF (7)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_OFF (8)

/** \\brief  Length for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_OFF (9)

/** \\brief  Length for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_LEN (6)

/** \\brief  Mask for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_OFF (0)

/** \\brief  Length for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_LEN (6)

/** \\brief  Mask for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_OFF (0)

/** \\brief  Length for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_LEN (6)

/** \\brief  Mask for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_OFF (0)

/** \\brief  Length for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_LEN (29)

/** \\brief  Mask for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_OFF (3)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_LEN (16)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_MSK (0xffff)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_OFF (16)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_OFF (3)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_OFF (8)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_OFF (1)

/** \\brief  Length for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_LEN (1)

/** \\brief  Mask for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_OFF (0)

/** \\brief  Length for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_OFF (8)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_OFF (9)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_LEN (6)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_LEN (19)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_MSK (0x7ffff)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_OFF (5)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_OFF (31)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_LEN (6)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_OFF (24)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_OFF (30)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXFLASH_BF_H */
